---
layout: post
title: "network-pratice"
comments: true
categories: Other
---

### 라우터 IP/서브넷 마스크 설정

1. ROUTER 1의 FastEthernet 0/0의 IP를 192.168.0.100/24로 설정하시오.(완료된 설정은 startup-config에 저장하시오)

Router> en // enable; 사용자모드에서 관리자 모드로 전환
Router# conf t // 관리자 모드에서 전역설정 모드로 전환
Enter configuration command, one per line. End with CNTL/Z

Router(config) # interface fastethernet 0/0
Router(config-if) # ip add 192.168.0.100 255.255.255.0
Router(config-if) # no shutdown // 활성화
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

Router(config-if) # exit
Router(config) @ exit
%STS-5-CONFIG_I: Configured from console by console
Router# copy r s // copy ruinning-config startup-config; 전역설정 모드에서 나가기
Destination filename [startup-config]?
Building configuration...[OK]
Router #

### 라우터 대역폭 설정

2. ROUTER2의 Serial 2/0의 대역폭을 2048로 설정하시오.

Router> en
Router# conf t 
Enter configuration command, one per line. End with CNTL/Z

Router(config) # interface serial 2/0
Router(config-if) # bandwidth 2048

Router(config-if) # exit
Router(config) @ exit
%STS-5-CONFIG_I: Configured from console by console
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

3. ROUTER1의 Serial 2/0의 클럭 속도를 72K로 설정하시오.

Router> en 
Router# conf t
Enter configuration command, one per line. End with CNTL/Z

Router(config) # interface serial 2/0
Router(config-if) # clock rate 72000

Router(config-if) # exit
Router(config) @ exit
%STS-5-CONFIG_I: Configured from console by console
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

### 라우터 주석(Description) 설정

4. FastEthernet 0/0의 Description을 설정하시오

Router> en 
Router# conf t 
Enter configuration command, one per line. End with CNTL/Z

Router(config) # interface fastethernet 0/0
Routher(config-if) # description ICQA

Router(config-if) # exit
Router(config) @ exit
%STS-5-CONFIG_I: Configured from console by console
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

### 라우터 Secondary IP Address 설정

5. ROUTER1의 Serial 2/0을 사용가능하게 IP주소를 192.168.0.101/24와 두번째 IP 192.168.0.102/24로 설정하고 활성화 하시오.

Router> en 
Router# conf t 
Enter configuration command, one per line. End with CNTL/Z

Router(config) # interface serial 2/0
Router(config-if) # ip add 192.168.0.101 255.255.255.0
Router(config-if) # ip add 192.168.0.102 255.255.255.0 secondary
Router(config-if) # no shutdown

Router(config-if) # exit
Router(config) @ exit
%STS-5-CONFIG_I: Configured from console by console\

Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

### 라우터 기본 게이트웨이 설정

6. 기본 게이트웨이를 설정하시오. IP: 192.168.0.10

Router> en 
Router# conf t 
Enter configuration command, one per line. End with CNTL/Z

Router(config) # ip default-gateway 192.168.0.10

Router(config) @ exit
%STS-5-CONFIG_I: Configured from console by console\
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

7. ROUTER1의 DHCP 네트워크를 192.168.100.0/24 서버 이름은 'icqa'로 설정하시오.

Router> en 
Router# conf t 
Enter configuration command, one per line. End with CNTL/Z

Router(config) # ip dhcp pool icqa 
Router(dhcp-config) # network 192.168.100.0 255.255.255.0

Router(dhcp-config) # exit
Router(config) @ exit
%STS-5-CONFIG_I: Configured from console by console\
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

### 라우터 텔넷 패스워드 설정

8. ROUTER1 Telnet에 접근하는 Password를 icqa로 설정하고 로그인하시오.

Router> en 
Router# conf t 
Enter configuration command, one per line. End with CNTL/Z

Router(config) # line vty 0 4 // virtual teletype or virtual terminal line 텔넷 설정 ; 가상터미널을 0~4까지 총 5개 사용하겠다는 의미
Router(config-line) # password icqa
Router(config-line) # login

Router(config-line) # exit
Router(config) @ exit
%STS-5-CONFIG_I: Configured from console by console\
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

### 라우터 텔넷 세션 자동종료 설정

9. 텔넷 연결 후 3분 50초 동안 입력이 없으면 세션이 자동 종료되도록 설정하시오.

Router> en 
Router# conf t 
Enter configuration command, one per line. End with CNTL/Z

Router(config) # line vty 0 4 
Router(config-line) # exec-timeout 03 50 // 텔넷에서 입력이 없으면 세션 자동종료(3분 50초)

Router(config-line) # exit
Router(config) @ exit
%STS-5-CONFIG_I: Configured from console by console\
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

### 라우터 콘솔 패스워드 설정

10. ROUTER1 console 0의 패스워드를 ICQA로 설정하고 로그인하시오.

Router> en 
Router# conf t 
Enter configuration command, one per line. End with CNTL/Z

Router(config) # line console 0 // console 0으로 이동
Router(config-line) # password ICQA // console 비밀번호를 ICQA로 설정
Router(config-line) # login

Router(config-line) # exit
Router(config) @ exit
%STS-5-CONFIG_I: Configured from console by console\
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

### 라우터 활성화 설정

11. ROUTER1 Serial 2/0을 활성화 시키시오.

Router> en 
Router# conf t 
Enter configuration command, one per line. End with CNTL/Z

Router(config) # interface serial 2/0
Router(config-if) # no shutdown
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to down

Router(config-if) # exit
Router(config) @ exit
%STS-5-CONFIG_I: Configured from console by console\
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

### 라우터 호스트네임 설정

12. Hostname을 network2로 변경하고 console 0의 password를 route5로 변경 후 로그인하시오.

Router> en 
Router# conf t 
Enter configuration command, one per line. End with CNTL/Z

Router(config) # hostname network2
network2(config) # line console 0
network2(config-line) # password route5
network2(config-line) # login

Router(config-line) # exit
Router(config) @ exit
%STS-5-CONFIG_I: Configured from console by console\
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

### 라우터 확인 문제 

1. 인터페이스 정보를 확인하고 저장하시오

Router> en 
Router# show interface
...
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

2. 접속한 사용자 정보를 확인하고 저장하시오

Router> en 
Router# show user
...
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

3. 라우팅 테이블 정보를 확인하고 저장하시오

Router> en 
Router# show ip route
...
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

4. 플래쉬 내용을 확인하고 저장하시오

Router> en 
Router# show flash
...
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #

5. 프로세스 정보를 확인하고 저장하시오

Router> en 
Router# show process
...
Router# copy r s 
Destination filename [startup-config]?
Building configuration...[OK]
Router #


### 리눅스 명령어

1. 윈도우의 ipconfig 명령어와 같이 리눅스에서 ip address 정보를 확인하는 명령어는?
- ifconfig

2. 리눅스에서 파일이나 폴더를 찾을 때 사용하는 명령어는?
- find

3. 리눅스에서 현재 설치된 하드디스크 용량을 확인하는 명령어는?
- df

4. 리눅스에서 현재 위치를 확인하고 싶을 때 사용하는 명령어는?
- pwd

5. 리눅스에서 도움말-매뉴얼을 호가인하는 명령어는? 또는 특정 명령어에 대한 설명을 보는 것은?
- man

6. 리눅스에서 포트/프로토콜 정보를 확인할 수 있는 명령어는?
- etc/ services

7. 리눅스에서 CPU 메모리 사용정보를 확인하는 명령어는?
- top

8. 네트워크의 연결상태와 라우팅 테이블 정보가 있는 DOS 창이 나오는 문제일 경우 이것과 관련된 명령어는?
- netstat

9. 리눅스에서 계정을 생성하는 과정이 사진으로 나왔는데,
- passwd

10. 이동명령어는?
- mv

11. 복사 명령어는?
- cp

12. 파일 타입 확인 명령어는?
- file

13. 강제종료 명령어는?
- reboot, shutdown -r now, init 0

